{
    "format": "layers-model",
    "generatedBy": "keras",
    "convertedBy": "TensorFlow.js Converter",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 10,
              "activation": "softmax"
            }
          }
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin", "group1-shard2of1.bin"],
        "weights": [
          {
            "name": "conv2d/kernel",
            "shape": [3, 3, 3, 32],
            "dtype": "float32"
          },
          {
            "name": "conv2d/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "dense/kernel",
            "shape": [32, 10],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [10],
            "dtype": "float32"
          }
        ]
      }
    ]
  }